[
    {
        "title": "NASA's New Mars Rover Will Use X-Rays to Hunt Fossils",
        "preview": "PIXL, an instrument on the end of the Perseverance rover's arm, will search for chemical fingerprints left by ancient microbes."
    },
    {
        "title": "Q&A with the Student Who Named Ingenuity, NASA's Mars Helicopter",
        "preview": "As a longtime fan of space exploration, Vaneeza Rupani appreciates the creativity and collaboration involved with trying to fly on another planet."
    },
    {
        "title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance",
        "preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan. "
    },
    {
        "title": "NASA's Perseverance Rover Mission Getting in Shape for Launch",
        "preview": "Stacking spacecraft components on top of each other is one of the final assembly steps before a mission launches to the Red Planet. "
    },
    {
        "title": "New Selfie Shows Curiosity, the Mars Chemist",
        "preview": "The NASA rover performed a special chemistry experiment at the location captured in its newest self-portrait."
    },
    {
        "title": "NASA's InSight Flexes Its Arm While Its 'Mole' Hits Pause",
        "preview": "Now that the lander's robotic arm has helped the mole get underground, it will resume science activities that have been on hold."
    },
    {
        "title": "NASA's Mars 2020 Heads Into the Test Chamber",
        "preview": "In this time-lapse video taken at JPL, engineers move the Mars 2020 rover into a large vacuum chamber for testing in Mars-like environmental conditions."
    },
    {
        "title": "7 Things to Know About the Mars 2020 Perseverance Rover Mission",
        "preview": "NASA's next rover to the Red Planet is slated to launch no earlier than July 30. These highlights will get you up to speed on the ambitious mission."
    },
    {
        "title": "Mars Scientists Investigate Ancient Life in Australia",
        "preview": "Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. "
    },
    {
        "title": "NASA's Treasure Map for Water Ice on Mars",
        "preview": "A new study identifies frozen water just below the Martian surface, where astronauts could easily dig it up."
    },
    {
        "title": "5 Hidden Gems Are Riding Aboard NASA's Perseverance Rover",
        "preview": "The symbols, mottos, and small objects added to the agency's newest Mars rover serve a variety of purposes, from functional to decorative."
    },
    {
        "title": "NASA InSight's 'Mole' Is Out of Sight",
        "preview": "Now that the heat probe is just below the Martian surface, InSight's arm will scoop some additional soil on top to help it keep digging so it can take Mars' temperature."
    },
    {
        "title": "My Culture, My Voice",
        "preview": "In honor of Hispanic Heritage Month, Christina Hernandez, an instrument engineer on the Mars 2020 mission, talks about her childhood and journey to NASA."
    },
    {
        "title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing",
        "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."
    },
    {
        "title": "Mars 2020 Unwrapped and Ready for More Testing",
        "preview": "In time-lapse video, bunny-suited engineers remove the inner layer of protective foil on NASA's Mars 2020 rover after it was relocated for testing."
    }
]