[
    {
        "title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover",
        "preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries. "
    },
    {
        "title": "Naming a NASA Mars Rover Can Change Your Life",
        "preview": "Want to name the robotic scientist NASA is sending to Mars in 2020? The student who named Curiosity — the rover currently exploring Mars — will tell you this is an opportunity worth taking."
    },
    {
        "title": "3 Things We've Learned From NASA's Mars InSight ",
        "preview": "Scientists are finding new mysteries since the geophysics mission landed two years ago."
    },
    {
        "title": "NASA Wins 4 Webbys, 4 People's Voice Awards",
        "preview": "Winners include the JPL-managed \"Send Your Name to Mars\" campaign, NASA's Global Climate Change website and Solar System Interactive."
    },
    {
        "title": "NASA's Briefcase-Size MarCO Satellite Picks Up Honors",
        "preview": "The twin spacecraft, the first of their kind to fly into deep space, earn a Laureate from Aviation Week & Space Technology."
    },
    {
        "title": "NASA's Mars 2020 Heads Into the Test Chamber",
        "preview": "In this time-lapse video taken at JPL, engineers move the Mars 2020 rover into a large vacuum chamber for testing in Mars-like environmental conditions."
    },
    {
        "title": "NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch",
        "preview": "The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."
    },
    {
        "title": "InSight's 'Mole' Team Peers into the Pit",
        "preview": "Efforts to save the heat probe continue."
    },
    {
        "title": "NASA's MAVEN Explores Mars to Understand Radio Interference at Earth",
        "preview": "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars."
    },
    {
        "title": "NASA's Perseverance Rover Will Carry First Spacesuit Materials to Mars",
        "preview": "In a Q&A, spacesuit designer Amy Ross explains how five samples, including a piece of helmet visor, will be tested aboard the rover, which is targeting a July 30 launch. "
    },
    {
        "title": "Global Storms on Mars Launch Dust Towers Into the Sky",
        "preview": "A Mars Dust Tower Stands Out Dust storms are common on Mars. But every decade or so, something unpredictable happens: a series of runaway storms break out, covering the entire planet in a dusty haze."
    },
    {
        "title": "NASA to Reveal Name of Its Next Mars Rover",
        "preview": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday. "
    },
    {
        "title": "MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss",
        "preview": "Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."
    },
    {
        "title": "NASA's MAVEN Observes Martian Night Sky Pulsing in Ultraviolet Light",
        "preview": "Vast areas of the Martian night sky pulse in ultraviolet light, according to images from NASA’s MAVEN spacecraft. The results are being used to illuminate complex circulation patterns in the Martian atmosphere."
    },
    {
        "title": "From JPL's Mailroom to Mars and Beyond",
        "preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."
    }
]